backend/controllers/SiteController.php

INSERT INTO `sumber_data` (`nama_cs`) VALUES ('Sensus 2010')
---
				$sumberData_=$sumberData::findOne(['nama_cs'=>$objPHPExcel->getActiveSheet()->getCellByColumnAndRow(1,1)->getValue(),])['id'];
				if($sumberData_==null){
					$sumberData->nama_cs=$objPHPExcel->getActiveSheet()->getCellByColumnAndRow(1,1)->getValue();
					$sumberData->insert();

INSERT INTO `fakta` (`tahun`, `nilai`, `id_bulan`, `id_wilayah`, `id_variabel`, `id_item_kategori`, `id_sumber_data`) VALUES (1961, 1629000, 1, '1100000000', 7, 1, 2)
---
						}
						else {
							$idwilayah=$wilayah::findOne(['nama'=>$objPHPExcel->getActiveSheet()->getCellByColumnAndRow($j,5)->getValue(),])['id'];
							\Yii::$app->db->createCommand()->insert('fakta',[
							'tahun'=>$tahun_,
							'nilai'=>$objPHPExcel->getActiveSheet()->getCellByColumnAndRow($j,$i)->getValue(),
							'id_bulan'=>$bulan_,
							'id_wilayah'=>$idwilayah,
							'id_variabel'=>$variabel_,
							'id_item_kategori'=>$itemKategori_,
							'id_sumber_data'=>$sumberData_,
							])->execute();