frontend/controllers/SiteController.php

SELECT * FROM `variabel` WHERE `id_topik`='1'
---
	public function actionData($wil,$var){

		//\Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
		Yii::$app->response->format = 'jsongis';
		$query = new Query;
			$query->select('wilayah.id ,wilayah.nama,fakta.nilai,fakta.tahun,variabel.satuan,fakta.id_bulan,bulan.nama')
			->from('fakta')
			->distinct('wilayah.id ,wilayah.nama,fakta.nilai,fakta.tahun,variabel.satuan,fakta.id_bulan,bulan.nama')
			->join('INNER JOIN', 'wilayah','fakta.id_wilayah=wilayah.id')
			->join('INNER JOIN', 'variabel','fakta.id_variabel=variabel.id')
			->join('INNER JOIN', 'topik','variabel.id_topik=topik.id')
			->join('INNER JOIN', 'bulan','fakta.id_bulan=bulan.id')
			->where('wilayah.tipe='.$wil.' AND variabel.id='.$var);
		$rows = $query->all();

SELECT `SELECT DISTINCT` AS `wilayah`.`id`, `wilayah`.`nama`, `wilayah`.`tipe` FROM `fakta` LEFT OUTER JOIN `wilayah` ON fakta.id_wilayah=wilayah.id WHERE wilayah.tipe=1
---
	public function actionChild() {
		\Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
		$out = [];
		if (isset($_POST['depdrop_parents'])) {
		$id = end($_POST['depdrop_parents']);
			$query = new Query;
			$query->select('topik.nama AS namaTopik,variabel.id, variabel.nama')
			->from('fakta')
			->distinct('variabel.id')
			->join('INNER JOIN', 'wilayah','fakta.id_wilayah=wilayah.id')
			->join('INNER JOIN', 'variabel','fakta.id_variabel=variabel.id')
			->join('INNER JOIN', 'topik','variabel.id_topik=topik.id')
			->orderBy('topik.nama')
			->where('wilayah.tipe='.$id);
			$list = $query->all();