backend/views/site/import.php

    'action' => Url::toRoute('site/download'),
]);
 $topik= new \common\models\TipeWilayah();
echo $form1->field($topik, 'nama')->widget(Select2::classname(), [
    'data' => ArrayHelper::map(\common\models\TipeWilayah::find()->all(), 'id', 'nama'),
	'options' => ['placeholder' => 'Select a state ...'],
    'pluginOptions' => [
        'allowClear' => true
    ],
]);
---
SELECT * FROM `tipe_wilayah`