backend/views/fakta/index.php

$this->title = 'Faktas';
$this->params['breadcrumbs'][] = $this->title;

$wilayah = \yii\helpers\ArrayHelper::map(
\common\models\Wilayah::find()->all(),
'id', 'nama');
---
SELECT * FROM `wilayah`