frontend/views/site/index.php

		<?php
$form=ActiveForm::begin();
$tipeWilayah= new \common\models\TipeWilayah();
echo $form->field($tipeWilayah, 'nama')->widget(Select2::classname(), [
'data' => ArrayHelper::map($tipeWilayah::find()->all(), 'id', 'nama'),
'options' => ['placeholder' => 'Tipe Wilayah'],
'pluginOptions' => [
'allowClear' => true
],
])->label('');
---
SELECT * FROM `tipe_wilayah`